Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/iperf_demo/src/packs/WBZ653_DFP/component/cvd.h
#define CVD_CVDRESH_POS_Pos                   _UINT32_(0)                                          /* (CVD_CVDRESH) The accumulated result of the positive-side measurements.Since the controller supports up to 128x oversampling, each polarity can accumulate up to 23 bits when using a 16-bitADC. The accumulation is not shifted back down to create an average. Therefore, if oversampling was requested, theSW will need to account for the left-shift of the result returned. Position */
#define CVD_CVDRESH_POS_Msk                   (_UINT32_(0xFFFFFF) << CVD_CVDRESH_POS_Pos)          /* (CVD_CVDRESH) The accumulated result of the positive-side measurements.Since the controller supports up to 128x oversampling, each polarity can accumulate up to 23 bits when using a 16-bitADC. The accumulation is not shifted back down to create an average. Therefore, if oversampling was requested, theSW will need to account for the left-shift of the result returned. Mask */
#define CVD_CVDRESH_POS(value)                (CVD_CVDRESH_POS_Msk & (_UINT32_(value) << CVD_CVDRESH_POS_Pos)) /* Assigment of value for POS in the CVD_CVDRESH register */
#define CVD_CVDRESH_Msk                       _UINT32_(0x00FFFFFF)                                 /* (CVD_CVDRESH) Register Mask  */


/* -------- CVD_CVDRESL : (CVD Offset: 0x14) ( R/ 32) CVD RESULTS NEG FIFO Read Register -------- */
#define CVD_CVDRESL_RESETVALUE                _UINT32_(0x00)                                       /*  (CVD_CVDRESL) CVD RESULTS NEG FIFO Read Register  Reset Value */

#define CVD_CVDRESL_NEG_Pos                   _UINT32_(0)                                          /* (CVD_CVDRESL) The accumulated result of the negative-side measurements.Since the controller supports up to 128x oversampling, each polarity can accumulate up to 23 bits when using a 16-bitADC. The accumulation is not shifted back down to create an average. Therefore, if oversampling was requested, theSW will need to account for the left-shift of the result returned. Position */
#define CVD_CVDRESL_NEG_Msk                   (_UINT32_(0xFFFFFF) << CVD_CVDRESL_NEG_Pos)          /* (CVD_CVDRESL) The accumulated result of the negative-side measurements.Since the controller supports up to 128x oversampling, each polarity can accumulate up to 23 bits when using a 16-bitADC. The accumulation is not shifted back down to create an average. Therefore, if oversampling was requested, theSW will need to account for the left-shift of the result returned. Mask */
#define CVD_CVDRESL_NEG(value)                (CVD_CVDRESL_NEG_Msk & (_UINT32_(value) << CVD_CVDRESL_NEG_Pos)) /* Assigment of value for NEG in the CVD_CVDRESL register */
#define CVD_CVDRESL_Msk                       _UINT32_(0x00FFFFFF)                                 /* (CVD_CVDRESL) Register Mask  */


/* -------- CVD_CVDRESD : (CVD Offset: 0x18) ( R/ 32) CVD RESULTS DESCRIPTOR FIFO Read Register -------- */
#define CVD_CVDRESD_RESETVALUE                _UINT32_(0x00)                                       /*  (CVD_CVDRESD) CVD RESULTS DESCRIPTOR FIFO Read Register  Reset Value */

#define CVD_CVDRESD_DELTA_Pos                 _UINT32_(0)                                          /* (CVD_CVDRESD) Delta of the accumulated results of the negative-side and positive-side measurements. Position */
#define CVD_CVDRESD_DELTA_Msk                 (_UINT32_(0x3FFFF) << CVD_CVDRESD_DELTA_Pos)         /* (CVD_CVDRESD) Delta of the accumulated results of the negative-side and positive-side measurements. Mask */
#define CVD_CVDRESD_DELTA(value)              (CVD_CVDRESD_DELTA_Msk & (_UINT32_(value) << CVD_CVDRESD_DELTA_Pos)) /* Assigment of value for DELTA in the CVD_CVDRESD register */
#define CVD_CVDRESD_RXINDEX_Pos               _UINT32_(19)                                         /* (CVD_CVDRESD) Receive Index for this result. If the Stride of the Scan Descriptor was more than one, the ReceiveIndex indicates the first one of the group. Position */
#define CVD_CVDRESD_RXINDEX_Msk               (_UINT32_(0x1F) << CVD_CVDRESD_RXINDEX_Pos)          /* (CVD_CVDRESD) Receive Index for this result. If the Stride of the Scan Descriptor was more than one, the ReceiveIndex indicates the first one of the group. Mask */
#define CVD_CVDRESD_RXINDEX(value)            (CVD_CVDRESD_RXINDEX_Msk & (_UINT32_(value) << CVD_CVDRESD_RXINDEX_Pos)) /* Assigment of value for RXINDEX in the CVD_CVDRESD register */
#define CVD_CVDRESD_SDNUM_Pos                 _UINT32_(24)                                         /* (CVD_CVDRESD) Scan Descriptor Number that generated this result Position */
#define CVD_CVDRESD_SDNUM_Msk                 (_UINT32_(0x3) << CVD_CVDRESD_SDNUM_Pos)             /* (CVD_CVDRESD) Scan Descriptor Number that generated this result Mask */
#define CVD_CVDRESD_SDNUM(value)              (CVD_CVDRESD_SDNUM_Msk & (_UINT32_(value) << CVD_CVDRESD_SDNUM_Pos)) /* Assigment of value for SDNUM in the CVD_CVDRESD register */
#define CVD_CVDRESD_TXINDEX_Pos               _UINT32_(27)                                         /* (CVD_CVDRESD) Transmit Index for this result. If the Stride of the Scan Descriptor was more than one, the Transmit Index indicates the first one of the group. Position */
#define CVD_CVDRESD_TXINDEX_Msk               (_UINT32_(0x1F) << CVD_CVDRESD_TXINDEX_Pos)          /* (CVD_CVDRESD) Transmit Index for this result. If the Stride of the Scan Descriptor was more than one, the Transmit Index indicates the first one of the group. Mask */
#define CVD_CVDRESD_TXINDEX(value)            (CVD_CVDRESD_TXINDEX_Msk & (_UINT32_(value) << CVD_CVDRESD_TXINDEX_Pos)) /* Assigment of value for TXINDEX in the CVD_CVDRESD register */
#define CVD_CVDRESD_Msk                       _UINT32_(0xFBFBFFFF)                                 /* (CVD_CVDRESD) Register Mask  */


/* -------- CVD_CVDRX0 : (CVD Offset: 0x80) (R/W 32) CVD RECEIVE INDEX 0-3 CONFIGURATION Register -------- */
#define CVD_CVDRX0_RESETVALUE                 _UINT32_(0x00)                                       /*  (CVD_CVDRX0) CVD RECEIVE INDEX 0-3 CONFIGURATION Register  Reset Value */

