Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/iperf_demo/src/packs/WBZ653_DFP/component/cvd.h
#define CVD_CVDSD3T2_SDCONTIME_Pos            _UINT32_(0)                                          /* (CVD_CVDSD3T2) Scan Descriptor Charge TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the CONVERT statewaiting for the ADC sample data. It must be ensured that the ADC will assert End-Of-Convert (EOC) before the CONVERT state timer expires. Position */
#define CVD_CVDSD3T2_SDCONTIME_Msk            (_UINT32_(0x7F) << CVD_CVDSD3T2_SDCONTIME_Pos)       /* (CVD_CVDSD3T2) Scan Descriptor Charge TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the CONVERT statewaiting for the ADC sample data. It must be ensured that the ADC will assert End-Of-Convert (EOC) before the CONVERT state timer expires. Mask */
#define CVD_CVDSD3T2_SDCONTIME(value)         (CVD_CVDSD3T2_SDCONTIME_Msk & (_UINT32_(value) << CVD_CVDSD3T2_SDCONTIME_Pos)) /* Assigment of value for SDCONTIME in the CVD_CVDSD3T2 register */
#define CVD_CVDSD3T2_SDPOLTIME_Pos            _UINT32_(8)                                          /* (CVD_CVDSD3T2) Scan Descriptor Polarity TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the POLARITY statebefore taking the second polarity measurement of an RX/TX pair Position */
#define CVD_CVDSD3T2_SDPOLTIME_Msk            (_UINT32_(0x7F) << CVD_CVDSD3T2_SDPOLTIME_Pos)       /* (CVD_CVDSD3T2) Scan Descriptor Polarity TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the POLARITY statebefore taking the second polarity measurement of an RX/TX pair Mask */
#define CVD_CVDSD3T2_SDPOLTIME(value)         (CVD_CVDSD3T2_SDPOLTIME_Msk & (_UINT32_(value) << CVD_CVDSD3T2_SDPOLTIME_Pos)) /* Assigment of value for SDPOLTIME in the CVD_CVDSD3T2 register */
#define CVD_CVDSD3T2_SDOVRTIME_Pos            _UINT32_(16)                                         /* (CVD_CVDSD3T2) Scan Descriptor Oversample TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the OVERSAMPstate before taking the next oversampling measurement of an RX/TX pair. Position */
#define CVD_CVDSD3T2_SDOVRTIME_Msk            (_UINT32_(0x7F) << CVD_CVDSD3T2_SDOVRTIME_Pos)       /* (CVD_CVDSD3T2) Scan Descriptor Oversample TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the OVERSAMPstate before taking the next oversampling measurement of an RX/TX pair. Mask */
#define CVD_CVDSD3T2_SDOVRTIME(value)         (CVD_CVDSD3T2_SDOVRTIME_Msk & (_UINT32_(value) << CVD_CVDSD3T2_SDOVRTIME_Pos)) /* Assigment of value for SDOVRTIME in the CVD_CVDSD3T2 register */
#define CVD_CVDSD3T2_SDCHNTIME_Pos            _UINT32_(24)                                         /* (CVD_CVDSD3T2) Scan Descriptor Channel TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the RXCHAN orTXCHAN state before moving to the next RX/TX pair Position */
#define CVD_CVDSD3T2_SDCHNTIME_Msk            (_UINT32_(0x7F) << CVD_CVDSD3T2_SDCHNTIME_Pos)       /* (CVD_CVDSD3T2) Scan Descriptor Channel TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the RXCHAN orTXCHAN state before moving to the next RX/TX pair Mask */
#define CVD_CVDSD3T2_SDCHNTIME(value)         (CVD_CVDSD3T2_SDCHNTIME_Msk & (_UINT32_(value) << CVD_CVDSD3T2_SDCHNTIME_Pos)) /* Assigment of value for SDCHNTIME in the CVD_CVDSD3T2 register */
#define CVD_CVDSD3T2_Msk                      _UINT32_(0x7F7F7F7F)                                 /* (CVD_CVDSD3T2) Register Mask  */


/* -------- CVD_CVDBG : (CVD Offset: 0x200) (R/W 32) CVD DEBUG REGISTER -------- */
#define CVD_CVDBG_RESETVALUE                  _UINT32_(0x00)                                       /*  (CVD_CVDBG) CVD DEBUG REGISTER  Reset Value */

#define CVD_CVDBG_SEL_L_Pos                   _UINT32_(0)                                          /* (CVD_CVDBG) Select signal to MUX debug signals on to port cvd_tst_dbg_data[15:0] Position */
#define CVD_CVDBG_SEL_L_Msk                   (_UINT32_(0xFFFF) << CVD_CVDBG_SEL_L_Pos)            /* (CVD_CVDBG) Select signal to MUX debug signals on to port cvd_tst_dbg_data[15:0] Mask */
#define CVD_CVDBG_SEL_L(value)                (CVD_CVDBG_SEL_L_Msk & (_UINT32_(value) << CVD_CVDBG_SEL_L_Pos)) /* Assigment of value for SEL_L in the CVD_CVDBG register */
#define CVD_CVDBG_SEL_H_Pos                   _UINT32_(16)                                         /* (CVD_CVDBG) Select signal to MUX debug signals on to port cvd_tst_dbg_data[31:16] Position */
#define CVD_CVDBG_SEL_H_Msk                   (_UINT32_(0xFFFF) << CVD_CVDBG_SEL_H_Pos)            /* (CVD_CVDBG) Select signal to MUX debug signals on to port cvd_tst_dbg_data[31:16] Mask */
#define CVD_CVDBG_SEL_H(value)                (CVD_CVDBG_SEL_H_Msk & (_UINT32_(value) << CVD_CVDBG_SEL_H_Pos)) /* Assigment of value for SEL_H in the CVD_CVDBG register */
#define CVD_CVDBG_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (CVD_CVDBG) Register Mask  */


/** \brief CVD register offsets definitions */
#define CVD_CVDCON_REG_OFST            _UINT32_(0x00)      /* (CVD_CVDCON) CVD Control Register Offset */
#define CVD_CVDADC_REG_OFST            _UINT32_(0x04)      /* (CVD_CVDADC) CVD ADC Configuration Register Offset */
#define CVD_CVDSTAT_REG_OFST           _UINT32_(0x08)      /* (CVD_CVDSTAT) CVD Status Register Offset */
#define CVD_CVDRESH_REG_OFST           _UINT32_(0x10)      /* (CVD_CVDRESH) CVD RESULTS POS FIFO Read Register (CVDRESH) Offset */
#define CVD_CVDRESL_REG_OFST           _UINT32_(0x14)      /* (CVD_CVDRESL) CVD RESULTS NEG FIFO Read Register Offset */
#define CVD_CVDRESD_REG_OFST           _UINT32_(0x18)      /* (CVD_CVDRESD) CVD RESULTS DESCRIPTOR FIFO Read Register Offset */
#define CVD_CVDRX0_REG_OFST            _UINT32_(0x80)      /* (CVD_CVDRX0) CVD RECEIVE INDEX 0-3 CONFIGURATION Register Offset */
#define CVD_CVDRX1_REG_OFST            _UINT32_(0x84)      /* (CVD_CVDRX1) CVD RECEIVE INDEX 4-7 CONFIGURATION Register Offset */
#define CVD_CVDRX2_REG_OFST            _UINT32_(0x88)      /* (CVD_CVDRX2) CVD RECEIVE INDEX 8-11 CONFIGURATION Register Offset */
#define CVD_CVDRX3_REG_OFST            _UINT32_(0x8C)      /* (CVD_CVDRX3) CVD RECEIVE INDEX 12-15 CONFIGURATION Register Offset */
#define CVD_CVDRX4_REG_OFST            _UINT32_(0x90)      /* (CVD_CVDRX4) CVD RECEIVE INDEX 16-17 CONFIGURATION Register Offset */
#define CVD_CVDTX0_REG_OFST            _UINT32_(0xC0)      /* (CVD_CVDTX0) CVD TRANSMIT INDEX 0-3 NCONFIGURATION Offset */
#define CVD_CVDTX1_REG_OFST            _UINT32_(0xC4)      /* (CVD_CVDTX1) CVD TRANSMIT INDEX 4-7 NCONFIGURATION Offset */
#define CVD_CVDTX2_REG_OFST            _UINT32_(0xC8)      /* (CVD_CVDTX2) CVD TRANSMIT INDEX 8-11 NCONFIGURATION Offset */
#define CVD_CVDTX3_REG_OFST            _UINT32_(0xCC)      /* (CVD_CVDTX3) CVD TRANSMIT INDEX 12-15 NCONFIGURATION Offset */
#define CVD_CVDTX4_REG_OFST            _UINT32_(0xD0)      /* (CVD_CVDTX4) CVD TRANSMIT INDEX 12-15 NCONFIGURATION Offset */
#define CVD_CVDSD0C1_REG_OFST          _UINT32_(0x100)     /* (CVD_CVDSD0C1) CVD SCAN DESCRIPTOR N CONTROL1 REGISTER Offset */
#define CVD_CVDSD0C2_REG_OFST          _UINT32_(0x104)     /* (CVD_CVDSD0C2) CVD SCAN DESCRIPTOR N CONTROL2 REGISTER Offset */
#define CVD_CVDSD0C3_REG_OFST          _UINT32_(0x108)     /* (CVD_CVDSD0C3) CVD SCAN DESCRIPTOR N CONTROL3 REGISTER Offset */
#define CVD_CVDSD0T2_REG_OFST          _UINT32_(0x10C)     /* (CVD_CVDSD0T2) CVD SCAN DESCRIPTOR N TIME2 REGISTER Offset */
#define CVD_CVDSD1C1_REG_OFST          _UINT32_(0x110)     /* (CVD_CVDSD1C1) CVD SCAN DESCRIPTOR N CONTROL1 REGISTER Offset */
#define CVD_CVDSD1C2_REG_OFST          _UINT32_(0x114)     /* (CVD_CVDSD1C2) CVD SCAN DESCRIPTOR N CONTROL2 REGISTER Offset */
#define CVD_CVDSD1C3_REG_OFST          _UINT32_(0x118)     /* (CVD_CVDSD1C3) CVD SCAN DESCRIPTOR N CONTROL3 REGISTER Offset */
#define CVD_CVDSD1T2_REG_OFST          _UINT32_(0x11C)     /* (CVD_CVDSD1T2) CVD SCAN DESCRIPTOR N TIME2 REGISTER Offset */
#define CVD_CVDSD2C1_REG_OFST          _UINT32_(0x120)     /* (CVD_CVDSD2C1) CVD SCAN DESCRIPTOR N CONTROL1 REGISTER Offset */
#define CVD_CVDSD2C2_REG_OFST          _UINT32_(0x124)     /* (CVD_CVDSD2C2) CVD SCAN DESCRIPTOR N CONTROL2 REGISTER Offset */
#define CVD_CVDSD2C3_REG_OFST          _UINT32_(0x128)     /* (CVD_CVDSD2C3) CVD SCAN DESCRIPTOR N CONTROL3 REGISTER Offset */
#define CVD_CVDSD2T2_REG_OFST          _UINT32_(0x12C)     /* (CVD_CVDSD2T2) CVD SCAN DESCRIPTOR N TIME2 REGISTER Offset */
#define CVD_CVDSD3C1_REG_OFST          _UINT32_(0x130)     /* (CVD_CVDSD3C1) CVD SCAN DESCRIPTOR N CONTROL1 REGISTER Offset */
#define CVD_CVDSD3C2_REG_OFST          _UINT32_(0x134)     /* (CVD_CVDSD3C2) CVD SCAN DESCRIPTOR N CONTROL2 REGISTER Offset */
#define CVD_CVDSD3C3_REG_OFST          _UINT32_(0x138)     /* (CVD_CVDSD3C3) CVD SCAN DESCRIPTOR N CONTROL3 REGISTER Offset */
#define CVD_CVDSD3T2_REG_OFST          _UINT32_(0x13C)     /* (CVD_CVDSD3T2) CVD SCAN DESCRIPTOR N TIME2 REGISTER Offset */
#define CVD_CVDBG_REG_OFST             _UINT32_(0x200)     /* (CVD_CVDBG) CVD DEBUG REGISTER Offset */

